test/fixtures/files/lemon_squeezy/order_created.json

{
  "meta": {
    "event_name": "order_created"
  },
  "data": {
    "type": "orders",
    "id": "1",
    "attributes": {
      "store_id": 1,
      "customer_id": 1,
      "identifier": "89b36d62-4f5c-4353-853f-0c769d0535c8",
      "order_number": 1,
      "user_name": "Dan R",
      "user_email": "dan@lemonsqueezy.com",
      "currency": "USD",
      "currency_rate": "1.00000000",
      "setup_fee": 4999,
      "subtotal": 5899,
      "discount_total": 0,
      "tax": 0,
      "total": 5899,
      "subtotal_usd": 5899,
      "discount_total_usd": 0,
      "tax_usd": 0,
      "total_usd": 5899,
      "tax_name": "ALV",
      "tax_rate": "24.00",
      "status": "paid",
      "status_formatted": "Paid",
      "refunded": null,
      "refunded_at": null,
      "subtotal_formatted": "$58.99",
      "discount_total_formatted": "$0.00",
      "tax_formatted": "$0.00",
      "total_formatted": "$58.99",
      "first_order_item": {
        "order_id": 1,
        "product_id": 1,
        "variant_id": 1,
        "product_name": "Product One",
        "variant_name": "Default",
        "price": 999,
        "created_at": "2023-01-17T12:26:23.000000Z",
        "updated_at": "2023-01-17T12:26:23.000000Z",
        "test_mode": false
      },
      "urls": {
        "receipt": "https://app.lemonsqueezy.com/my-orders/89b36d62-4f5c-4353-853f-0c769d0535c8?signature=8847fff02e1bfb0c7c43ff1cdf1b1657a8eed2029413692663b86859208c9f42"
      },
      "created_at": "2023-01-17T12:26:23.000000Z",
      "updated_at": "2023-01-17T12:26:23.000000Z",
      "test_mode": false
    },
    "relationships": {
      "store": {
        "links": {
          "related": "https://api.lemonsqueezy.com/v1/orders/1/store",
          "self": "https://api.lemonsqueezy.com/v1/orders/1/relationships/store"
        }
      },
      "customer": {
        "links": {
          "related": "https://api.lemonsqueezy.com/v1/orders/1/customer",
          "self": "https://api.lemonsqueezy.com/v1/orders/1/relationships/customer"
        }
      },
      "order-items": {
        "links": {
          "related": "https://api.lemonsqueezy.com/v1/orders/1/order-items",
          "self": "https://api.lemonsqueezy.com/v1/orders/1/relationships/order-items"
        }
      },
      "subscriptions": {
        "links": {
          "related": "https://api.lemonsqueezy.com/v1/orders/1/subscriptions",
          "self": "https://api.lemonsqueezy.com/v1/orders/1/relationships/subscriptions"
        }
      },
      "license-keys": {
        "links": {
          "related": "https://api.lemonsqueezy.com/v1/orders/1/license-keys",
          "self": "https://api.lemonsqueezy.com/v1/orders/1/relationships/license-keys"
        }
      },
      "discount-redemptions": {
        "links": {
          "related": "https://api.lemonsqueezy.com/v1/orders/1/discount-redemptions",
          "self": "https://api.lemonsqueezy.com/v1/orders/1/relationships/discount-redemptions"
        }
      }
    },
    "links": {
      "self": "https://api.lemonsqueezy.com/v1/orders/1"
    }
  }
}
